# **Task 1: Load and inspect the dataset*
**Load data_safe_copy.csv into a DataFrame named scores. Confirm the row count is at least 300 and print the first five rows. Run info() and verify that score is numeric.**

In [1]:
import pandas as pd
import numpy as np

In [2]:
scores = pd.read_csv("data_safe_copy.csv")

In [3]:
scores

    student_id cohort   module assignment  score
0         S001  alpha  Module1         A1     78
1         S001  alpha  Module1         A2     84
2         S001  alpha  Module2         A1     79
3         S001  alpha  Module2         A2     86
4         S001  alpha  Module3         A1     81
..         ...    ...      ...        ...    ...
295       S050   beta  Module1         A2     77
296       S050   beta  Module2         A1     73
297       S050   beta  Module2         A2     76
298       S050   beta  Module3         A1     75
299       S050   beta  Module3         A2     78

[300 rows x 5 columns]

In [34]:
len(scores)

300

In [35]:
scores.head()

  student_id cohort   module assignment  score
0       S001  alpha  Module1         A1     78
1       S001  alpha  Module1         A2     84
2       S001  alpha  Module2         A1     79
3       S001  alpha  Module2         A2     86
4       S001  alpha  Module3         A1     81

In [36]:
scores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  300 non-null    object
 1   cohort      300 non-null    object
 2   module      300 non-null    object
 3   assignment  300 non-null    object
 4   score       300 non-null    int64
dtypes: int64(1), object(4)
memory usage: 11.8+ KB

In [37]:
scores['score'].dtype

dtype('int64')

# **Task 2: Build a student roster table and merge*
**Create a small DataFrame named roster with columns student_id and status, where status is either "active" or "inactive". Include at least 10 student IDs that are not present in the scores dataset. Merge scores with roster using a left join so all score rows remain. Confirm that missing statuses exist after the merge and count them.**

In [38]:
extra_ids = list(range(-10,0))
roster_data = {
    'student_id' : extra_ids,
    'status' : ['inactive' if i%2 ==0 
                        else 'active' for i in range(10)]
}

In [39]:
roster = pd.DataFrame(roster_data)
roster

   student_id    status
0         -10  inactive
1          -9    active
2          -8  inactive
3          -7    active
4          -6  inactive
5          -5    active
6          -4  inactive
7          -3    active
8          -2  inactive
9          -1    active

In [40]:
roster['student_id'] = roster['student_id'].astype('str')

In [41]:
merged_df = pd.merge(scores, roster, on='student_id', how='left')

In [42]:
merged_df

    student_id cohort   module assignment  score status
0         S001  alpha  Module1         A1     78    NaN
1         S001  alpha  Module1         A2     84    NaN
2         S001  alpha  Module2         A1     79    NaN
3         S001  alpha  Module2         A2     86    NaN
4         S001  alpha  Module3         A1     81    NaN
..         ...    ...      ...        ...    ...    ...
295       S050   beta  Module1         A2     77    NaN
296       S050   beta  Module2         A1     73    NaN
297       S050   beta  Module2         A2     76    NaN
298       S050   beta  Module3         A1     75    NaN
299       S050   beta  Module3         A2     78    NaN

[300 rows x 6 columns]

In [45]:
# the columns that we added as student_id which doesn't contains scores table didn't added.
# but why?
# because when we left join scores with roster there is no student_ids like (-10,0)
# inside of scores table.
# if we were doing left join but firtly roster after scores at this time new student_ids
# should be added

In [46]:
missing_status_count = merged_df['status'].isna().sum()
missing_status_count

np.int64(300)

# **Task 3: Aggregate by module and cohort*
**Compute the average score by cohort and module using groupby. Store the result in a DataFrame named avg_by_module. Then compute the overall average score by cohort only and compare the values to ensure the module-level averages roll up as expected.**

In [52]:
avg_by_module = scores.groupby(["cohort","module"])['score'].mean().reset_index()
avg_by_module

  cohort   module      score
0  alpha  Module1  77.970588
1  alpha  Module2  78.382353
2  alpha  Module3  79.794118
3   beta  Module1  78.647059
4   beta  Module2  78.411765
5   beta  Module3  80.029412
6  gamma  Module1  76.218750
7  gamma  Module2  76.468750
8  gamma  Module3  77.843750

In [54]:
avg_by_cohort = scores.groupby('cohort')['score'].mean().reset_index()
avg_by_cohort

  cohort      score
0  alpha  78.715686
1   beta  79.029412
2  gamma  76.843750

# **Task 4: Reshape to a wide report*
**Create a wide table where rows are student_id, columns are module, and values are the average score per student per module. Use pivot_table with mean as the aggregation. Store the result in student_module_report.**

**Validate that the number of rows equals the number of unique students in the original dataset and that the column labels match the set of module names.**

In [55]:
student_module_report = scores.pivot_table(
    index = 'student_id',
    columns = 'module',
    values = 'score',
    aggfunc = 'mean'
)

In [56]:
student_module_report

module      Module1  Module2  Module3
student_id
S001           81.0     82.5     84.5
S002           73.5     72.0     75.0
S003           87.5     88.5     89.5
S004           68.5     67.5     69.5
S005           81.5     82.5     83.5
S006           76.0     75.0     77.0
S007           89.0     89.0     90.5
S008           71.0     70.0     72.0
S009           79.5     78.5     80.5
S010           84.5     85.5     86.5
S011           73.0     72.0     74.0
S012           80.5     79.5     81.5
S013           66.5     67.5     68.5
S014           91.5     92.5     93.5
S015           74.5     73.5     75.5
S016           83.0     84.0     85.0
S017           70.5     69.5     71.5
S018           77.0     78.0     79.0
S019           83.5     84.5     85.5
S020           71.5     70.5     72.5
S021           87.5     88.5     89.5
S022           69.5     68.5     70.5
S023           80.0     81.0     82.0
S024           73.5     72.5     74.5
S025           78.5     79.5     80.5
S026           69.5     70.5     71.5
S027           85.5     86.5     87.5
S028           74.5     75.5     76.5
S029           80.5     81.5     82.5
S030           72.5     73.5     74.5
S031           86.5     87.5     88.5
S032           71.5     70.5     72.5
S033           77.5     78.5     79.5
S034           83.5     84.5     85.5
S035           69.5     68.5     70.5
S036           75.5     74.5     76.5
S037           81.5     82.5     83.5
S038           70.5     69.5     71.5
S039           76.5     77.5     78.5
S040           83.5     84.5     85.5
S041           67.5     68.5     69.5
S042           74.5     73.5     75.5
S043           82.5     83.5     84.5
S044           71.5     70.5     72.5
S045           89.5     90.5     91.5
S046           73.5     72.5     74.5
S047           80.5     81.5     82.5
S048           68.5     67.5     69.5
S049           87.5     88.5     89.5
S050           75.5     74.5     76.5

In [59]:
scores['student_id'].unique()

array(['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008',
       'S009', 'S010', 'S011', 'S012', 'S013', 'S014', 'S015', 'S016',
       'S017', 'S018', 'S019', 'S020', 'S021', 'S022', 'S023', 'S024',
       'S025', 'S026', 'S027', 'S028', 'S029', 'S030', 'S031', 'S032',
       'S033', 'S034', 'S035', 'S036', 'S037', 'S038', 'S039', 'S040',
       'S041', 'S042', 'S043', 'S044', 'S045', 'S046', 'S047', 'S048',
       'S049', 'S050'], dtype=object)

In [60]:
scores['student_id'].nunique()

50

In [61]:
len(student_module_report) == scores['student_id'].nunique()

True

# **Task 5: Ranking and top performers*
**For each cohort, identify the top 3 students by overall average score. Use groupby plus sorting or rank logic. Store the results in a DataFrame named top_students with columns student_id, cohort, and avg_score.**

**Add a check that each cohort appears exactly three times in top_students.**

In [65]:
# Calculate the mean score for each student within their cohort
student_averages = scores.groupby(['cohort', 'student_id'])['score'].mean().reset_index()
student_averages.columns = ['cohort', 'student_id', 'avg_score']

In [63]:
# Sort by cohort (ascending) and score (descending)
top_students = student_averages.sort_values(['cohort', 'avg_score'], ascending=[True, False])

# Group by cohort and take the top 3
top_students = top_students.groupby('cohort').head(3).reset_index(drop=True)

# Reorder columns as requested
top_students = top_students[['student_id', 'cohort', 'avg_score']]

print("Top 3 Students per Cohort:")
print(top_students)

Top 3 Students per Cohort:
  student_id cohort  avg_score
0       S003  alpha       88.5
1       S049  alpha       88.5
2       S027  alpha       86.5
3       S045   beta       90.5
4       S007   beta       89.5
5       S021   beta       88.5
6       S014  gamma       92.5
7       S040  gamma       84.5
8       S016  gamma       84.0

# **Validation:**

In [64]:
# Count occurrences of each cohort
cohort_counts = top_students['cohort'].value_counts()

# Check if all counts are exactly 3
check_passed = (cohort_counts == 3).all()

print(f"\nCohort Frequency Counts:\n{cohort_counts}")
if check_passed:
    print("✅ Validation Passed: Each cohort appears exactly three times.")
else:
    print("⚠️ Validation Failed: Some cohorts have more or fewer than 3 top students.")

Cohort Frequency Counts:
cohort
alpha    3
beta     3
gamma    3
Name: count, dtype: int64
✅ Validation Passed: Each cohort appears exactly three times.